# Ex2 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

In [2]:
df=pd.read_csv("student_marks (1).csv")
df

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77
10,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
11,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
12,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
13,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

### Step 3. Assign it to a variable called chipo.

In [3]:
chipo=pd.read_csv("student_marks (1).csv")
chipo

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77
10,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
11,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
12,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
13,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

### Step 4. See the first 10 entries

In [4]:
chipo=pd.read_csv("student_marks (1).csv")
chipo.head(10)

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

### Step 5. What is the number of observations in the dataset?

In [5]:
chipo=pd.read_csv("student_marks (1).csv")
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  14 non-null     object
 1   Gender      14 non-null     object
 2   DOB         14 non-null     object
 3   Maths       14 non-null     int64
 4   Physics     14 non-null     int64
 5   Chemistry   14 non-null     int64
 6   English     14 non-null     int64
 7   Biology     14 non-null     int64
 8   Economics   14 non-null     int64
 9   History     14 non-null     int64
 10  Civics      14 non-null     int64
dtypes: int64(8), object(3)
memory usage: 1.3+ KB

### Step 6. What is the number of columns in the dataset?

In [6]:
chipo=pd.read_csv("student_marks (1).csv")
chipo.shape[1]

11

### Step 7. Print the name of all the columns.

In [7]:
chipo=pd.read_csv("student_marks (1).csv")
chipo.columns

Index(['Unnamed: 0', 'Gender', 'DOB', 'Maths', 'Physics', 'Chemistry',
       'English', 'Biology', 'Economics', 'History', 'Civics'],
      dtype='object')

### Step 8. How is the dataset indexed?

### Step 9. Which was the most-ordered item?

### Step 10. For the most-ordered item, how many items were ordered?

### Step 11. What was the most ordered item in the choice_description column?

### Step 12. How many items were orderd in total?

### Step 13. Turn the item price into a float

#### Step 13.a. Check the item price type

#### Step 13.b. Create a lambda function and change the type of item price

#### Step 13.c. Check the item price type

### Step 14. How much was the revenue for the period in the dataset?

### Step 15. How many orders were made in the period?

### Step 16. What is the average revenue amount per order?

In [8]:
# Solution 1

In [9]:
# Solution 2

### Step 17. How many different items are sold?